InformationRegisters/ТелеграмСмещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмСмещение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Смещение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмСмещение/Ext/ManagerModule.bsl
Процедура Зафиксировать(Бот, Смещение) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмСмещение.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Бот = Бот;
	МенеджерЗаписи.Смещение = Смещение;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
